
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КомплектующиеНаСкладе Приход
	Движения.КомплектующиеНаСкладе.Записывать = Истина;
	
	Для Каждого ТекСтрокаКомплектующие Из Комплектующие Цикл
		Если ТекСтрокаКомплектующие.Цена = 0 Тогда
			ТекСтрокаКомплектующие.Цена = Сервисный.ПолучитьПоследнююЦенуЗакупки(ТекСтрокаКомплектующие.Комплектующее, Дата);
		КонецЕсли;
		
		ТекСтрокаКомплектующие.Сумма = ТекСтрокаКомплектующие.Количество * ТекСтрокаКомплектующие.Цена;
		
		Движение = Движения.КомплектующиеНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Комплектующее = ТекСтрокаКомплектующие.Комплектующее;
		Движение.Количество = ТекСтрокаКомплектующие.Количество;
		
		Если ЗначениеЗаполнено(ТекСтрокаКомплектующие.Комплектующее) И ТекСтрокаКомплектующие.Цена > 0 Тогда
			ЗаписьЦены = РегистрыСведений.ЦеныКомплектующих.СоздатьМенеджерЗаписи();
			ЗаписьЦены.Период = Дата;
			ЗаписьЦены.Комплектующее = ТекСтрокаКомплектующие.Комплектующее;
			ЗаписьЦены.Цена = ТекСтрокаКомплектующие.Цена;
			ЗаписьЦены.Записать();
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
