
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
	
	Объект.Наименование = Объект.Фамилия;
	
	Если Объект.Имя <> "" Тогда
		Объект.Наименование = Объект.Наименование + " " + Лев(Объект.Имя,1) + ".";
	КонецЕсли;
	
	Если Объект.Отчество <> "" Тогда
		Объект.Наименование = Объект.Наименование + Лев(Объект.Отчество,1) + ".";
	КонецЕсли;
	
КонецПроцедуры