
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Накопители.Количество() <= 1 Тогда
		Элементы.ГруппаОдиночнойСтроки.Видимость = Истина;
		Элементы.Накопители.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОдиночнойСтроки.Видимость = Ложь;
		Элементы.Накопители.Видимость = Истина;
	КонецЕсли;
	Если Объект.Накопители.Количество() = 0 Тогда
		НоваяСтрока = Объект.Накопители.Добавить();
		НоваяСтрока.Количество = 1;
	КонецЕсли;
	
	ПересчитатьЦены();
	
	//ЗадатьОграничение();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоманда(Команда)
	Объект.Накопители.Добавить();
	Элементы.ГруппаОдиночнойСтроки.Видимость = Ложь;
	Элементы.Накопители.Видимость = Истина;
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура НакопителиПослеУдаления(Элемент)
	Если Объект.Накопители.Количество() <= 1 Тогда
		Элементы.ГруппаОдиночнойСтроки.Видимость = Истина;
		Элементы.Накопители.Видимость = Ложь;
		
		//Элементы.Накопители.ТекущиеДанные.Количество = 1;
	Иначе
		Элементы.ГруппаОдиночнойСтроки.Видимость = Ложь;
		Элементы.Накопители.Видимость = Истина;
	КонецЕсли;
	ПересчитатьЦены();
КонецПроцедуры


Функция ПроверкаСовместимости()
	
	Массив = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Процессор) Тогда
		Массив.Добавить(Объект.Процессор);	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.МатеринскаяПлата) Тогда
		Массив.Добавить(Объект.МатеринскаяПлата);	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОперативнаяПамять) Тогда
		Массив.Добавить(Объект.ОперативнаяПамять);	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Видеокарта) Тогда
		Массив.Добавить(Объект.Видеокарта);		
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.БлокПитания) Тогда
		Массив.Добавить(Объект.БлокПитания);	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Корпус) Тогда
		Массив.Добавить(Объект.Корпус);	
	КонецЕсли;
	
	Ошибка = Сервисный.ПроверитьСовместимостьСервер(Массив);
	
	Если Ошибка <> "" Тогда
		Сообщить(Ошибка);
	КонецЕсли;
	
КонецФункции // ПроверкаСовместимости()

&НаКлиенте
Процедура ПроцессорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Процессор"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
	//ПараметрыФормы = Новый структура("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Процессор"));
	//ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	//ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры  

&НаКлиенте
Процедура МатеринскаяПлатаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыФормы = Новый структура("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "МатеринскаяПлата"));
	//ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	//ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "МатеринскаяПлата"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура БлокПитанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыФормы = Новый структура("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "БлокПитания"));
	//ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	//ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "БлокПитания"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КорпусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Корпус"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВидеокартаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Видеокарта"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОхлаждениеПроцессораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//ПараметрыФормы = Новый структура("ТипКомплектующего", Сервисный.Группакулеров());
	//ПараметрыФормы.Вставить("РежимВыбора", "ТолькоИзГруппы");
	//
	//ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	Отбор = Новый Структура;
	Отбор.Вставить("Родитель", Сервисный.Группакулеров());
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативнаяПамятьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "ОперативнаяПамять"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НакопительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Накопитель"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НакопителиНакопительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипКомплектующего", Сервисный.ПолучитьЗначениеПеречисления("ТипКомплектующего", "Накопитель"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", "БезГрупп");
	ОткрытьФорму("Справочник.Комплектующее.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроцессорПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура МатеринскаяПлатаПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура БлокПитанияПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ВидеокартаПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ОхлаждениеПроцессораПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ОперативнаяПамятьПриИзменении(Элемент)
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура НакопительПриИзменении(Элемент)
	
	ПроверкаСовместимости();
	ПересчитатьЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура НакопителиНакопительПриИзменении(Элемент)
	Если Объект.Накопители.Количество() <= 1 Тогда
		Элементы.ГруппаОдиночнойСтроки.Видимость = Истина;
		Элементы.Накопители.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОдиночнойСтроки.Видимость = Ложь;
		Элементы.Накопители.Видимость = Истина;
	КонецЕсли;
	
	Если Элементы.Накопители.ТекущиеДанные.Количество < 1 Тогда
		Элементы.Накопители.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
	
	ПроверкаСовместимости();
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ПересчитатьЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьРаботыПриИзменении(Элемент)
	
	ПересчитатьЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	
	ПересчитатьЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура НакопителиКоличествоПриИзменении(Элемент)
	
	Если Элементы.Накопители.ТекущиеДанные <> Неопределено И Элементы.Накопители.ТекущиеДанные.Количество < 1 Тогда
		Элементы.Накопители.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	ПересчитатьЦены();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦены()
	
	РезультатРасчета = РассчитатьЦеныНаСервере();
	Объект.СтоимостьКомплектующих = РезультатРасчета.СтоимостьКомплектующих;
	Объект.РекомендуемаяЦена = РезультатРасчета.РекомендуемаяЦена;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьЦеныНаСервере()
	
	Комплектующие = Сервисный.ПолучитьКомплектующиеСборки(Объект);
	СтоимостьКомплектующих = Сервисный.РассчитатьСебестоимостьКомплектующих(Комплектующие, Объект.Дата);
	
	Возврат Новый Структура(
		"СтоимостьКомплектующих, РекомендуемаяЦена",
		СтоимостьКомплектующих,
		СтоимостьКомплектующих + Объект.СтоимостьРаботы + Объект.Наценка);
	
КонецФункции


//Процедура ЗадатьОграничение()
//	новыеПараметрыВыбора = Новый Массив();
//	Параметр = новый ПараметрВыбора("ТипКомплектующего", Сервисный.процессор());
//	новыеПараметрыВыбора.Добавить(Параметр);
//	ЭтаФорма.Элементы.Процессор.ПараметрыВыбора = Новый ФиксированныйМассив(новыеПараметрыВыбора);
//КонецПроцедуры
