
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТекущаяЦена = Сервисный.ПолучитьПоследнююЦенуЗакупки(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ХарактеристикиХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	Тип = Объект.ТипКомплектующего;

//    СписокСсылок = ПолучитьСвойстваПоТипу(Тип);

//    НовыйОтбор = Новый Структура("СписокСсылок", СписокСсылок);
//    ПараметрыФормы = Новый Структура("Отбор", НовыйОтбор);
//	ОткрытьФорму("Справочник.СвойствоКомплектующего.ФормаВыбора", ПараметрыФормы, , , , ,);
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьСвойстваПоТипу(ТипКомплектующего)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|   Свойство.Ссылка
//	|ИЗ
//	|   Справочник.СвойствоКомплектующего КАК Свойство
//	|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|       Справочник.СвойствоКомплектующего.ДопустимыеТипы КАК Типы
//	|   ПО Типы.Ссылка = Свойство.Ссылка
//	|ГДЕ
//	|   Типы.ТипКомплектующего = &Тип";
//	
//	Запрос.УстановитьПараметр("Тип", ТипКомплектующего);
//	
//	Результат = Запрос.Выполнить().Выгрузить();
//	Возврат Результат.ВыгрузитьКолонку("Ссылка");
//	
//КонецФункции
