&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчитатьЦенуПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументСборкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументСборки) Тогда
		Объект.Заказчик = Объект.ДокументСборки.Заказчик;
	КонецЕсли;
	ПересчитатьЦенуПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяГарантияПриИзменении(Элемент)
	
	ПересчитатьЦенуПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуПродажи()
	
	Объект.ЦенаПродажи = РассчитатьЦенуПродажиНаСервере();
	
КонецПроцедуры

&НаСервере
Функция РассчитатьЦенуПродажиНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументСборки) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Объект.ДокументСборки.РекомендуемаяЦена + Сервисный.ПолучитьЦенуГарантии(Объект.ДополнительнаяГарантия);
	
КонецФункции
