
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Контроль остатков
	// 1. Сбор данных о требуемом расходе комплектующих
	СписокТребований = Новый Структура;
	
	ТаблицаТребований = ПолучитьСписокКомплектующихИзНовойСтруктуры(); 
	
	Для Каждого ТЗ из ТаблицаТребований Цикл
		ТЗ.Количество = ТЗ.Количество * Количество;	
	КонецЦикла;
	
	СтоимостьКомплектующих = Сервисный.РассчитатьСебестоимостьКомплектующих(ТаблицаТребований, Дата);
	РекомендуемаяЦена = СтоимостьКомплектующих + СтоимостьРаботы + Наценка;
	
	Если ТаблицаТребований.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат; 
	КонецЕсли;
	
	// 2. Проверка наличия остатков
	ПроверкаУспешна = ПроверитьНаличиеКомплектующих(ТаблицаТребований);
	
	Если Не ПроверкаУспешна Тогда
		Отказ = Истина;
		Возврат; 
	КонецЕсли;
	
	// 3. Формирование движений-расход регистра
	Движения.КомплектующиеНаСкладе.Очистить();
	Для Каждого СтрокаТЗ Из ТаблицаТребований Цикл
   		Движение = Движения.КомплектующиеНаСкладе.ДобавитьРасход();
    	Движение.Период = Дата;
       	Движение.Комплектующее = СтрокаТЗ.Комплектующее; 
    	Движение.Количество = СтрокаТЗ.Количество; 
	КонецЦикла;
	
	Движения.КомплектующиеНаСкладе.Записывать = Истина;
	Попытка
		Движения.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при записи движений: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецПопытки;
	
	
	///////////////////////////////////////////////////////////////////
	
	// регистр СобранныеКомпьютеры
	Движения.СобранныеКомпьютеры.Записывать = Истина;
	Для Каждого СтрокаТЗ Из ТаблицаТребований Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Комплектующее) Или СтрокаТЗ.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.СобранныеКомпьютеры.Добавить();
		Движение.ДокументСборки = Ссылка;
		Движение.Заказчик = Заказчик;
		Движение.АвторСборки = Сборщик;
		Движение.Комплектующие = СтрокаТЗ.Комплектующее;
		Движение.Количество = СтрокаТЗ.Количество;
		Движение.Себестоимость = СтоимостьКомплектующих;
		Движение.СтоимостьРаботы = СтоимостьРаботы;
		Движение.СтоимостьГарантии = 0;
		Движение.ЦенаПродажи = РекомендуемаяЦена;
		Движение.Статус = Перечисления.СтатусСборки.ВСборке;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокКомплектующихИзНовойСтруктуры() Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Вставить(0, "Комплектующее", Новый ОписаниеТипов("СправочникСсылка.Комплектующее"));
	ТЗ.Колонки.Вставить(1, "Количество", Новый ОписаниеТипов("Число"));
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.Процессор; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.МатеринскаяПлата; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.БлокПитания; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.Корпус; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.Видеокарта; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.ОхлаждениеПроцессора; 
	НоваяСтрока.Количество = 1;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Комплектующее = ЭтотОбъект.ОперативнаяПамять; 
	НоваяСтрока.Количество = 1;
	
	Индекс = ТЗ.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если НЕ ЗначениеЗаполнено(ТЗ[Индекс].Комплектующее) Тогда
			ТЗ.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
        |   Накопители.Накопитель КАК Накопитель,
        |   СУММА(Накопители.Количество) КАК Количество
        |ПОМЕСТИТЬ Накопители
        |ИЗ
        |   Документ.СборкаКомпьютеров.Накопители КАК Накопители
        |ГДЕ
        |   Накопители.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   Накопители.Накопитель
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   Накопитель
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Накопители.Накопитель КАК Накопитель,
        |   Накопители.Количество КАК Количество
        |ИЗ
        |   Накопители КАК Накопители";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Комплектующее = ВыборкаЗапроса.Накопитель;
		НоваяСтрока.Количество = ВыборкаЗапроса.Количество;
	КонецЦикла;
	
	
	Возврат ТЗ;
КонецФункции

Функция ПроверитьНаличиеКомплектующих(Требования) Экспорт
	
	ВсеВКСебе = Истина;
	СообщенияОСбое = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Требования.Комплектующее КАК Комплектующее,
	|	Требования.Количество КАК ТребуемоеКоличество
	|ПОМЕСТИТЬ ВТ_Требования
	|ИЗ
	|	&Требования КАК Требования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ВТ_Требования.Комплектующее КАК Комплектующее,
	|	ВТ_Требования.ТребуемоеКоличество КАК ТребуемоеКоличество,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК ТекущийОстаток
	|ИЗ
	|	ВТ_Требования КАК ВТ_Требования
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.КомплектующиеНаСкладе.Остатки(
	|			&МоментВремени,
	|			Комплектующее В
	|				(ВЫБРАТЬ
	|					ВТ_Требования.Комплектующее
	|				ИЗ
	|					ВТ_Требования КАК ВТ_Требования)
	|		) КАК Остатки
	|		ПО ВТ_Требования.Комплектующее = Остатки.Комплектующее";
	
	Запрос.УстановитьПараметр("Требования", Требования);
	Запрос.УстановитьПараметр("МоментВремени", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТребуемоеКоличество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ТекущийОстаток < Выборка.ТребуемоеКоличество Тогда
			
			ВсеВКСебе = Ложь;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно комплектующих: '" + СсылкаНаПредставление(Выборка.Комплектующее) + "'. Требуется: " + Строка(Выборка.ТребуемоеКоличество) + " шт., доступно: " + Строка(Выборка.ТекущийОстаток) + " шт.";
			
			СообщенияОСбое.Добавить(Сообщение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Сообщение Из СообщенияОСбое Цикл
		Сообщение.Значение.Сообщить();
	КонецЦикла;
	
	Возврат ВсеВКСебе;
	
КонецФункции

Функция СсылкаНаПредставление(Ссылка) 
    Если ЗначениеЗаполнено(Ссылка) Тогда
        Возврат Строка(Ссылка);
    Иначе
        Возврат "(Не указан)";
    КонецЕсли;
КонецФункции

