
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Список.Отбор.Элементы.Очистить();
	//
	//
	Если Параметры.РежимВыбора = "БезГрупп" Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	//ИначеЕсли Параметры.РежимВыбора = "ТолькоИзГруппы" Тогда
		//ЭлементОтбора = Список.Отбор.Элементы; 
		//Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
		//ЭлементОтбора.Использование = Истина;
		//ЭлементОтбора.ПравоеЗначение = Параметры.ТипКомплектующего;
		//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	КонецЕсли;
	
	
	
КонецПроцедуры
