&НаКлиенте
Процедура КомплектующиеКомплектующееПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Комплектующие.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Цена = ПолучитьПоследнююЦенуКомплектующего(ТекущаяСтрока.Комплектующее);
	ПересчитатьСуммуСтроки(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКоличествоПриИзменении(Элемент)
	
	Если Элементы.Комплектующие.ТекущиеДанные <> Неопределено Тогда
		ПересчитатьСуммуСтроки(Элементы.Комплектующие.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеЦенаПриИзменении(Элемент)
	
	Если Элементы.Комплектующие.ТекущиеДанные <> Неопределено Тогда
		ПересчитатьСуммуСтроки(Элементы.Комплектующие.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(СтрокаКомплектующие)
	
	СтрокаКомплектующие.Сумма = СтрокаКомплектующие.Количество * СтрокаКомплектующие.Цена;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююЦенуКомплектующего(Комплектующее)
	
	Возврат Сервисный.ПолучитьПоследнююЦенуЗакупки(Комплектующее);
	
КонецФункции
