
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьНаименование()
	
	Объект.Наименование = Объект.Фамилия;
	
	Если Объект.Имя <> "" Тогда
		Объект.Наименование = Объект.Наименование + " " + Лев(Объект.Имя,1) + ".";
	КонецЕсли;
	
	Если Объект.Отчество <> "" Тогда
		Объект.Наименование = Объект.Наименование + Лев(Объект.Отчество,1) + ".";
	КонецЕсли;
	
КонецПроцедуры       


&НаКлиенте
Процедура ТипКлиентаПриИзменении(Элемент)
	
	Результат = Сервисный.ТипОбъектаЮрЛицо(Объект.ТипКлиента);
	СкрытьПоляЮрЛиц(не Результат);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Результат = Сервисный.ТипОбъектаЮрЛицо(Объект.ТипКлиента);
	СкрытьПоляЮрЛиц(не Результат);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоляЮрЛиц(Скрывать)
	
	Если Скрывать Тогда
		Элементы.НазваниеОрганизации.Видимость = Ложь;
		Элементы.Адрес.Видимость = Ложь;
		Элементы.ИНН.Видимость = Ложь;
	Иначе
		Элементы.НазваниеОрганизации.Видимость = Истина;
		Элементы.Адрес.Видимость = Истина;
		Элементы.ИНН.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры



