
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗначенияЗаполнения.Свойство("Объект") Тогда
		Комплектующее = Параметры.ЗначенияЗаполнения.Объект;
		Запись.Объект = Комплектующее;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвойствоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокСсылок = ПолучитьСвойстваПоЭлементу(Запись.Объект);

	Список = Новый СписокЗначений;
	Для каждого Ссылка Из СписокСсылок Цикл
    	Список.Добавить(Ссылка);
	КонецЦикла;

	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("Ссылка", Список);

	ПараметрыФормы = Новый Структура("Отбор", НовыйОтбор);
	ОткрытьФорму("ПланВидовХарактеристик.СвойстваКомплектующих.ФормаВыбора", ПараметрыФормы, Элемент, , , ,);
КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваПоЭлементу(Элемент)
	
    ТипКомплектующего = Элемент.ТипКомплектующего; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Свойство.Ссылка
	|ИЗ
	|   ПланВидовХарактеристик.СвойстваКомплектующих КАК Свойство
	|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|       ПланВидовХарактеристик.СвойстваКомплектующих.ТипКомплектующего КАК Типы
	|   ПО Типы.Ссылка = Свойство.Ссылка
	|ГДЕ
	|   Типы.ТипКомплектующего = &Тип";
	
	Запрос.УстановитьПараметр("Тип", ТипКомплектующего);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции