

Процедура ПередЗаписью(Отказ)
	
	//Для Каждого СтрТабЧасти Из Характеристики Цикл
	//    
	//    Допустимо = Ложь;

	//    Для Каждого ТипСтр Из СтрТабЧасти.Свойство.ДопустимыеТипы Цикл
	//        
	//        Если ТипСтр.ТипКомплектующего = ТипКомплектующего Тогда
	//            Допустимо = Истина;
	//            Прервать;
	//        КонецЕсли;

	//    КонецЦикла;

	//    Если Не Допустимо Тогда
	//        Отказ = Истина;
	//        Сообщить("Свойство " + СтрТабЧасти.Свойство + " нельзя применять к этому типу комплектующего");
	//        Возврат;
	//    КонецЕсли;

	//КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Сервисный.ЗаписатьЦенуКомплектующего(Ссылка, ТекущаяЦена);
	КонецЕсли;
	
КонецПроцедуры
